99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_twt/esp32_mquickjs_wifi_twt_sdk.c
        current.node == identity->node && current.request_id == identity->request_id &&
        current.dialog == identity->dialog && current.flow == identity->flow;
}
bool esp32_mquickjs_wifi_twt_sdk_setup_tx_matches_native(unsigned slot,
    const esp32_mquickjs_wifi_twt_setup_timer_identity_t *identity)
{
    if (!esp32_mquickjs_wifi_twt_sdk_setup_timer_matches_native(slot, 26, identity)) return false;
    uint32_t phase;
    memcpy(&phase, setup_timer_param + 336U + 4U * slot, sizeof(phase));
    /* The original TX callback indexes temporary IDs by the frame's flow,
     * including its failed-lookup branch. Never let it touch a successor. */
    return phase == 0U && s_tmp_itwt_id[identity->flow] == identity->request_id;
}
static const uint8_t *twt_probe_node_native(void)
{
    const uint8_t *station, *node;
    memcpy(&station, g_ic + 16, sizeof(station));
    if (station == NULL) return NULL;
    memcpy(&node, station + 228, sizeof(node));
    return node;
}
bool esp32_mquickjs_wifi_twt_sdk_probe_active_native(void)
{
    const uint8_t *current = twt_probe_node_native();
    return current != NULL && current[1056] != 0U;
}
bool esp32_mquickjs_wifi_twt_sdk_probe_capture_native(const void *argument, uintptr_t *node, uint8_t *phase)
{
    if (node == NULL || phase == NULL) return false;
    const uint8_t *current = twt_probe_node_native();
    if (current == NULL || argument != current + 1057 || current[1056] == 0U || current[1057] > 1U)
        return false;
    *node = (uintptr_t)current;
    *phase = current[1057];
    return true;
}
bool esp32_mquickjs_wifi_twt_sdk_probe_matches_native(uintptr_t node, uint8_t phase)
{
    if (phase > 1U) return false;
    const uint8_t *current = twt_probe_node_native();
    return current != NULL && (uintptr_t)current == node && current[1056] != 0U && current[1057] == phase;
}
bool esp32_mquickjs_wifi_twt_sdk_probe_abort_native(uintptr_t node, uint8_t phase)
{
    /* The reviewed probe acquires one PM wake reference before TX. Only its
     * exact current active node/phase may release it. Clear before calling
     * SDK, so repeated cleanup and a later TX callback cannot release twice.
     * This does not touch node storage or invent a radio timeout event. */
    if (!esp32_mquickjs_wifi_twt_sdk_probe_matches_native(node, phase)) return false;
    uint8_t *current = (uint8_t *)twt_probe_node_native();
    current[1056] = 0;
    esp32_mquickjs_wifi_twt_probe_wake_done_native();
    return true;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_probe_cancel_native(uint32_t identity)
{
    esp_err_t error = esp32_mquickjs_wifi_twt_probe_result_cancel_begin_native(identity);
    if (error != ESP_OK) return error;
    error = esp32_mquickjs_wifi_twt_probe_timer_cancel_native();
    esp32_mquickjs_wifi_twt_probe_result_cancel_end_native(identity, error);
    return error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_setup_cancel_native(uint32_t identity)
{
    esp32_mquickjs_wifi_twt_setup_result_t result;
    esp_err_t error = esp32_mquickjs_wifi_twt_setup_result_read(identity, &result);
    if (error != ESP_OK) return error;
    if (result.flags & (ESP32_MQUICKJS_WIFI_TWT_SETUP_SUBMITTING | ESP32_MQUICKJS_WIFI_TWT_TEARDOWN_SUBMITTING))
        return ESP_ERR_INVALID_STATE;
    bool teardown = (result.flags & ESP32_MQUICKJS_WIFI_TWT_TEARDOWN_ATTEMPTED) != 0U;
    if (teardown && !(result.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_NATIVE_CLOSED) &&
        (!(result.flags & ESP32_MQUICKJS_WIFI_TWT_TEARDOWN_SEEN) ||
        result.teardown_status != 1U || (result.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_AMBIGUOUS)))
        return ESP_ERR_NOT_FINISHED;
    uint8_t pending = 0, flows = result.cancelled_flows;
    for (unsigned i = 0; i < 8U; ++i) {
        if (s_itwt_id[i] == result.request_id) return ESP_ERR_NOT_FINISHED;
        if (s_tmp_itwt_id[i] == result.request_id) flows |= (uint8_t)(1U << i);
        if (!(setup_timer_param[368] & (1U << i))) continue;
        int16_t request_id;
        memcpy(&request_id, setup_timer_param + 320U + 2U * i, sizeof(request_id));
        if (request_id != result.request_id) continue;
        uint32_t phase;
        memcpy(&phase, setup_timer_param + 336U + 4U * i, sizeof(phase));
        if (phase > 2U) return ESP_ERR_INVALID_STATE;
        const uint8_t *frame = setup_timer_param + 17U * i;
        uint8_t flow = (frame[3] >> 7) | ((frame[4] & 3U) << 1);
        flows |= (uint8_t)(1U << flow);
        pending |= (uint8_t)(1U << i);
    }
    if ((pending & (pending - 1U)) != 0U) return ESP_ERR_INVALID_STATE;
    /* The reviewed invalid-AP-parameters path can set a flow bitmap without
     * establishing its ID. Do not erase such state or claim clean cancellation.
     * An AP-selected flow may differ from the originally requested one. */
    if (result.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_SEEN)
        flows |= (uint8_t)(1U << result.event.config.flow_id);
    if (flows & s_itwt_flow_id_bitmap) return ESP_ERR_INVALID_STATE;
    for (unsigned i = 0; i < 8U; ++i) {
        if ((flows & (1U << i)) && s_tmp_itwt_id[i] >= 0 && s_tmp_itwt_id[i] != result.request_id)
            return ESP_ERR_INVALID_STATE;
        if ((setup_timer_param[368] & (1U << i)) && !(pending & (1U << i))) {
            const uint8_t *frame = setup_timer_param + 17U * i;
            uint8_t flow = (frame[3] >> 7) | ((frame[4] & 3U) << 1);
            if (flows & (1U << flow)) return ESP_ERR_INVALID_STATE;
        }
    }
    error = esp32_mquickjs_wifi_twt_setup_timer_cancel_native(result.request_id, pending);
    if (error != ESP_OK) return error;
    error = esp32_mquickjs_wifi_twt_information_timer_cleanup_native(result.request_id, flows);
    if (error != ESP_OK) return error;
    if (teardown) {
        uint32_t revision;
        error = esp32_mquickjs_wifi_twt_teardown_tx_quiescent_native(identity, &revision);
        if (error != ESP_OK) return error;
    }
    /* Timer authority is revoked and its handles deleted first. Keep all
     * pending IDs on any cleanup failure so retries retain exact ownership. */
    setup_timer_param[368] &= (uint8_t)~pending;
    for (unsigned i = 0; i < 8U; ++i) {
        if (pending & (1U << i)) {
            uint32_t phase = 0;
            memcpy(setup_timer_param + 336U + 4U * i, &phase, sizeof(phase));
        }
        if (s_tmp_itwt_id[i] == result.request_id) s_tmp_itwt_id[i] = -1;
    }
    return esp32_mquickjs_wifi_twt_setup_result_cancelled_native(identity, flows) ? ESP_OK : ESP_ERR_INVALID_STATE;
}
bool esp32_mquickjs_wifi_twt_sdk_teardown_tx_matches_native(uint32_t identity, uintptr_t node, uint8_t flow)
{
    if (identity == 0U || node == 0U || flow > 7U || (uintptr_t)twt_probe_node_native() != node) return false;
    const uint8_t *station;
    uint32_t state;
    memcpy(&station, g_ic + 16, sizeof(station));
    if (station == NULL) return false;
    memcpy(&state, station + 152, sizeof(state));
    if (state != 5U) return false;
    esp32_mquickjs_wifi_twt_setup_result_t result;
    return esp32_mquickjs_wifi_twt_setup_result_read(identity, &result) == ESP_OK &&
        (result.flags & ESP32_MQUICKJS_WIFI_TWT_TEARDOWN_ATTEMPTED) &&
        !(result.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_NATIVE_CLOSED) && result.teardown_flow == flow &&
        s_itwt_id[flow] == result.request_id && (s_itwt_flow_id_bitmap & (1U << flow)) && s_tmp_itwt_id[flow] < 0;
}
int wifi_sta_itwt_teardown_process(void *message);
esp_err_t esp32_mquickjs_wifi_twt_sdk_setup_teardown_native(uint32_t identity, uint8_t flow)
{
    if (identity == 0U || flow > 7U) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_twt_setup_result_t result;
    esp_err_t error = esp32_mquickjs_wifi_twt_setup_result_read(identity, &result);
    if (error != ESP_OK) return error;
    if (result.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_NATIVE_CLOSED) return ESP_ERR_INVALID_STATE;
    /* Action's public ioctl entry already checks driver initialization/start.
     * Recheck the current associated node before the original handler, which
     * otherwise dereferences the Station pointer without a null check. */
    const uint8_t *station;
    uint32_t state;
    memcpy(&station, g_ic + 16, sizeof(station));
    if (station == NULL || twt_probe_node_native() == NULL) return ESP_ERR_WIFI_NOT_ASSOC;
    memcpy(&state, station + 152, sizeof(state));
    if (state != 5U) return ESP_ERR_WIFI_NOT_ASSOC;
    if (s_itwt_id[flow] != result.request_id || !(s_itwt_flow_id_bitmap & (1U << flow)) ||
        s_tmp_itwt_id[flow] >= 0) return ESP_ERR_INVALID_STATE;
    for (unsigned i = 0; i < 8U; ++i) {
        if (i != flow && s_itwt_id[i] == result.request_id) return ESP_ERR_INVALID_STATE;
        if (!(setup_timer_param[368] & (1U << i))) continue;
        int16_t pending_id;
        memcpy(&pending_id, setup_timer_param + 320U + 2U * i, sizeof(pending_id));
        const uint8_t *frame = setup_timer_param + 17U * i;
        uint8_t pending_flow = (frame[3] >> 7) | ((frame[4] & 3U) << 1);
        if (pending_id == result.request_id || pending_flow == flow) return ESP_ERR_INVALID_STATE;
    }
    error = esp32_mquickjs_wifi_twt_teardown_tx_begin_native(identity, (uintptr_t)twt_probe_node_native(), flow);
    if (error != ESP_OK) return error;
    error = esp32_mquickjs_wifi_twt_setup_result_teardown_begin_native(identity, flow);
    if (error != ESP_OK) {
        esp32_mquickjs_wifi_twt_teardown_tx_abandon_native(identity);
        return error;
    }
    /* Reviewed operation 111 reads only flow byte 8. Keep its native PMF,
     * management-frame construction and asynchronous completion behavior. */
    uint8_t message[24] = {0};
    message[8] = flow;
    error = wifi_sta_itwt_teardown_process(message);
    esp_err_t tx_error = esp32_mquickjs_wifi_twt_teardown_tx_end_native(identity, error);
    esp32_mquickjs_wifi_twt_setup_result_teardown_submitted_native(identity, error);
    return error != ESP_OK ? error : tx_error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_setup_quiescent_native(uint32_t identity,
    esp32_mquickjs_wifi_twt_setup_cut_t *cut)
{
    if (identity == 0U || cut == NULL) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_twt_setup_result_t result;
    esp_err_t error = esp32_mquickjs_wifi_twt_setup_result_read(identity, &result);
    if (error != ESP_OK) return error;
    bool teardown = (result.flags & ESP32_MQUICKJS_WIFI_TWT_TEARDOWN_ATTEMPTED) != 0U;
    if (teardown && !(result.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_NATIVE_CLOSED) &&
        (!(result.flags & ESP32_MQUICKJS_WIFI_TWT_TEARDOWN_SEEN) ||
        result.teardown_status != 1U || (result.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_AMBIGUOUS)))
        return ESP_ERR_NOT_FINISHED;
    if (!(result.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_CANCELLED) ||
        (result.flags & (ESP32_MQUICKJS_WIFI_TWT_SETUP_SUBMITTING | ESP32_MQUICKJS_WIFI_TWT_TEARDOWN_SUBMITTING)) || result.observation_calls)
        return ESP_ERR_NOT_FINISHED;
    uint8_t flows = result.cancelled_flows;
    if (result.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_SEEN) flows |= (uint8_t)(1U << result.event.config.flow_id);
    for (unsigned i = 0; i < 8U; ++i) {
        if (s_itwt_id[i] == result.request_id || s_tmp_itwt_id[i] == result.request_id) return ESP_ERR_NOT_FINISHED;
        if (setup_timer_param[368] & (1U << i)) {
            int16_t request_id;
            memcpy(&request_id, setup_timer_param + 320U + 2U * i, sizeof(request_id));
            if (request_id == result.request_id) return ESP_ERR_NOT_FINISHED;
            const uint8_t *frame = setup_timer_param + 17U * i;
            uint8_t flow = (frame[3] >> 7) | ((frame[4] & 3U) << 1);
            if (flows & (1U << flow)) return ESP_ERR_INVALID_STATE;
        }
        if ((flows & (1U << i)) && (s_itwt_id[i] >= 0 || s_tmp_itwt_id[i] >= 0 ||
            twt_timer_present(&itwt_information_timer[i]))) return ESP_ERR_INVALID_STATE;
    }
    if (flows & (s_itwt_flow_id_bitmap | s_itwt_suspend_flow_id_bitmap | s_itwt_resume_flow_id_bitmap))
        return ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_twt_tx_snapshot_t tx;
    esp32_mquickjs_wifi_twt_tx_cleanup_native();
    esp32_mquickjs_wifi_twt_tx_snapshot(&tx);
    if (tx.fault != ESP32_MQUICKJS_WIFI_TWT_TX_OK) return ESP_ERR_INVALID_STATE;
    if (tx.tracked || tx.output_calls || tx.recycle_calls || tx.probe_calls) return ESP_ERR_NOT_FINISHED;
    if (tx.revision == UINT32_MAX) return ESP_ERR_NO_MEM;
    esp32_mquickjs_wifi_twt_setup_cut_t current = {.tx_revision = tx.revision};
    error = esp32_mquickjs_wifi_twt_setup_timer_quiescent_native(result.request_id, &current.timer_revision);
    if (error != ESP_OK) return error;
    error = esp32_mquickjs_wifi_twt_information_timer_quiescent_native(result.request_id, &current.information_revision);
    if (error != ESP_OK) return error;
    if (teardown) error = esp32_mquickjs_wifi_twt_teardown_tx_quiescent_native(identity, &current.teardown_revision);
    if (error == ESP_OK) *cut = current;
    return error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_setup_release_native(uint32_t identity,
    const esp32_mquickjs_wifi_twt_setup_cut_t *cut, uint32_t sequence)
{
    if (cut == NULL || sequence == 0U) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_twt_setup_cut_t current;
    esp_err_t error = esp32_mquickjs_wifi_twt_sdk_setup_quiescent_native(identity, &current);
    if (error != ESP_OK) return error;
    if (current.tx_revision != cut->tx_revision || current.timer_revision != cut->timer_revision ||
        current.information_revision != cut->information_revision || current.teardown_revision != cut->teardown_revision)
        return ESP_ERR_NOT_FINISHED;
    esp32_mquickjs_wifi_twt_setup_result_t result;
    error = esp32_mquickjs_wifi_twt_setup_result_read(identity, &result);
    if (error != ESP_OK) return error;
    return esp32_mquickjs_wifi_twt_setup_result_release_native(identity, result.revision, sequence)
        ? ESP_OK : ESP_ERR_NOT_FINISHED;
}
int __wrap_wifi_sta_itwt_send_probe_req_process(void *message);
esp_err_t esp32_mquickjs_wifi_twt_sdk_probe_submit_native(uint32_t timeout_ms, uint32_t *identity)
{
    if (identity == NULL || *identity != 0U || timeout_ms == 0U ||
        timeout_ms > ESP32_MQUICKJS_WIFI_TWT_MAX_TIMEOUT_MS) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_twt_probe_result_snapshot_t before, after;
    esp32_mquickjs_wifi_twt_probe_result_snapshot(&before);
    if (before.owned) return ESP_ERR_INVALID_STATE;
    /* Reviewed handler reads only word 12 from this synchronous message;
     * association/timer/TX admission remains in the production wrapper. Do
     * not call the public locking SDK API from inside its own ioctl task. */
    uint32_t message[4] = {0, 0, 0, timeout_ms};
    esp_err_t error = __wrap_wifi_sta_itwt_send_probe_req_process(message);
    esp32_mquickjs_wifi_twt_probe_result_snapshot(&after);
    if (after.identity != before.identity) {
        *identity = after.identity;
        if (!esp32_mquickjs_wifi_twt_probe_result_claim_native(after.identity)) return ESP_ERR_INVALID_STATE;
    }
    return error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_probe_quiescent_native(uint32_t identity,
    esp32_mquickjs_wifi_twt_probe_cut_t *cut)
{
    if (identity == 0U || cut == NULL) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_twt_sdk_snapshot_t snapshot;
    esp_err_t error = esp32_mquickjs_wifi_twt_sdk_snapshot_native(&snapshot);
    if (error != ESP_OK) return error;
    if (snapshot.probe_result.identity != identity || !snapshot.probe_result.owned) return ESP_ERR_INVALID_STATE;
    if (snapshot.tx.fault != ESP32_MQUICKJS_WIFI_TWT_TX_OK) return ESP_ERR_INVALID_STATE;
    if (!snapshot.probe_result.cancel_complete || snapshot.probe_result.submitting || snapshot.probe_result.observation_calls ||
        snapshot.probe_active || snapshot.probe_timer_present || snapshot.probe_timer.current_identity ||
        snapshot.probe_timer.cleanup_pending || snapshot.probe_wake.held || snapshot.probe_wake.acquiring ||
        snapshot.probe_wake.releasing || snapshot.probe_wake.fault != ESP_OK ||
        snapshot.tx.probe_calls || snapshot.tx.probe_buffer_present) return ESP_ERR_NOT_FINISHED;
    *cut = (esp32_mquickjs_wifi_twt_probe_cut_t){snapshot.tx.revision, snapshot.probe_timer.last_identity};
    return ESP_OK;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_probe_release_native(uint32_t identity,
    const esp32_mquickjs_wifi_twt_probe_cut_t *cut, uint32_t sequence)
{
    if (cut == NULL || sequence == 0U) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_twt_probe_cut_t current;
    esp_err_t error = esp32_mquickjs_wifi_twt_sdk_probe_quiescent_native(identity, &current);
    if (error != ESP_OK) return error;
    if (current.tx_revision != cut->tx_revision || current.timer_identity != cut->timer_identity)
        return ESP_ERR_NOT_FINISHED;
    return esp32_mquickjs_wifi_twt_probe_result_release_native(identity, sequence) ? ESP_OK : ESP_ERR_NOT_FINISHED;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_snapshot_native(esp32_mquickjs_wifi_twt_sdk_snapshot_t *output)
{
    if (output == NULL) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_twt_sdk_snapshot_t snapshot = {
        .individual_flow_bitmap = s_itwt_flow_id_bitmap,
        .individual_pending_mask = setup_timer_param[368],
        .individual_suspend_bitmap = s_itwt_suspend_flow_id_bitmap,
        .individual_resume_bitmap = s_itwt_resume_flow_id_bitmap,
        .broadcast_id_bitmap = s_btwt_id_bitmap,
        .probe_timer_present = twt_timer_present(&itwt_probe_timer),
        .probe_phase = UINT8_MAX,
    };
    const uint8_t *probe_node = twt_probe_node_native();
    if (probe_node != NULL && probe_node[1056] != 0U) {
        snapshot.probe_active = true;
        snapshot.probe_phase = probe_node[1057];
    }
    memcpy(snapshot.individual_ids, s_itwt_id, sizeof(snapshot.individual_ids));
    memcpy(snapshot.individual_temporary_ids, s_tmp_itwt_id, sizeof(snapshot.individual_temporary_ids));
    for (unsigned i = 0; i < 8U; ++i) {
        snapshot.individual_pending_ids[i] = -1;
        snapshot.individual_pending_flows[i] = UINT8_MAX;
        if (snapshot.individual_pending_mask & (1U << i)) {
            memcpy(&snapshot.individual_pending_ids[i], setup_timer_param + 320U + 2U * i, sizeof(int16_t));
            const uint8_t *frame = setup_timer_param + 17U * i;
            snapshot.individual_pending_flows[i] = (frame[3] >> 7) | ((frame[4] & 3U) << 1);
        }
        if (twt_timer_present(setup_timer_param + 144U + 20U * i))
            snapshot.individual_setup_timer_mask |= (uint8_t)(1U << i);
        if (twt_timer_present(&itwt_information_timer[i]))
            snapshot.individual_information_timer_mask |= (uint8_t)(1U << i);
    }
    for (unsigned i = 0; i < 32U; ++i)
        if (twt_timer_present(btwt_setup_timer + 20U * i))
            snapshot.broadcast_setup_timer_mask |= UINT32_C(1) << i;
    esp32_mquickjs_wifi_twt_tx_cleanup_native();
    esp32_mquickjs_wifi_twt_tx_snapshot(&snapshot.tx);
    esp32_mquickjs_wifi_twt_probe_timer_snapshot(&snapshot.probe_timer);
    esp32_mquickjs_wifi_twt_probe_result_snapshot(&snapshot.probe_result);
    esp32_mquickjs_wifi_twt_probe_wake_snapshot(&snapshot.probe_wake);
    esp32_mquickjs_wifi_twt_setup_timer_snapshot(&snapshot.setup_timer);
    esp32_mquickjs_wifi_twt_setup_results_snapshot(&snapshot.setup_results);
    esp32_mquickjs_wifi_twt_teardown_tx_snapshot(&snapshot.teardown_tx);
    esp32_mquickjs_wifi_twt_information_timer_snapshot(&snapshot.information_timer);
    esp32_mquickjs_wifi_btwt_timer_snapshot(&snapshot.broadcast_timer);
    *output = snapshot;
    return ESP_OK;
}

