99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_twt/esp32_mquickjs_wifi_twt_sdk.c
esp_err_t __real_wifi_sta_itwt_setup_process(void *message);
esp_err_t __real_wifi_sta_btwt_setup_process(void *message);
/* The public C5 wrapper checks established flows, but the native handler picks
 * an unchecked first-free slot from a DIFFERENT eight-entry pending bitmap.
 * Guard that capacity and pending-flow collisions inside the same native task
 * as the actual mutation. This is admission protection, not retirement proof. */
static esp_err_t twt_individual_setup_process(void *message, wifi_itwt_setup_config_t *config,
    uint32_t managed_identity, esp_err_t *driver_error)
{
    /* The reviewed dwell completion enables modem sleep when PS is NONE.
     * Require an explicit caller policy before a managed setup can reach it. */
    if (managed_identity != 0U && pm_get_sleep_type() == 0) return ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_itwt_options_t options = {.config = *config, .timeout_ms = 1};
    if (!esp32_mquickjs_wifi_itwt_options_valid(&options)) return ESP_ERR_INVALID_ARG;
    if (esp32_mquickjs_wifi_twt_setup_request_closed_native((int16_t)config->twt_id)) return ESP_ERR_INVALID_STATE;
    esp_err_t timer_error = esp32_mquickjs_wifi_twt_setup_timer_error();
    if (timer_error != ESP_OK) return timer_error;
    esp32_mquickjs_wifi_twt_sdk_snapshot_t snapshot;
    (void)esp32_mquickjs_wifi_twt_sdk_snapshot_native(&snapshot);
    if (snapshot.tx.fault != ESP32_MQUICKJS_WIFI_TWT_TX_OK) return ESP_ERR_INVALID_STATE;
    if (snapshot.individual_pending_mask == UINT8_MAX) return ESP_ERR_WIFI_TWT_FULL;
    uint8_t unavailable = snapshot.individual_flow_bitmap;
    for (unsigned i = 0; i < 8U; ++i) {
        if (snapshot.individual_ids[i] == (int16_t)config->twt_id ||
            snapshot.individual_temporary_ids[i] == (int16_t)config->twt_id ||
            snapshot.individual_pending_ids[i] == (int16_t)config->twt_id) return ESP_ERR_INVALID_ARG;
        if (snapshot.individual_pending_mask & (1U << i))
            unavailable |= (uint8_t)(1U << snapshot.individual_pending_flows[i]);
    }
    if (unavailable == UINT8_MAX) return ESP_ERR_WIFI_TWT_FULL;
    unsigned flow = config->flow_id;
    if (unavailable & (1U << flow)) {
        for (flow = 0; flow < 8U && (unavailable & (1U << flow)); ++flow) {}
    }
    /* The SDK already documents in/out flow selection. Reserve a free flow
     * taking pending requests into account before its established-only search. */
    uint32_t identity = managed_identity;
    esp_err_t error = identity != 0U ? ESP_OK :
        esp32_mquickjs_wifi_twt_setup_result_begin_native((int16_t)config->twt_id, &identity);
    if (error != ESP_OK) return error;
    if (managed_identity != 0U && !esp32_mquickjs_wifi_twt_setup_submit_driver_native(config, managed_identity))
        return ESP_ERR_INVALID_STATE;
    config->flow_id = flow;
    error = __real_wifi_sta_itwt_setup_process(message);
    *driver_error = error;
    timer_error = esp32_mquickjs_wifi_twt_setup_timer_error();
    if (timer_error != ESP_OK) error = timer_error;
    if (managed_identity == 0U) esp32_mquickjs_wifi_twt_setup_result_submitted_native(identity, error);
    return error;
}
esp_err_t __wrap_wifi_sta_itwt_setup_process(void *message)
{
    if (message == NULL) return ESP_ERR_INVALID_ARG;
    wifi_itwt_setup_config_t *config;
    memcpy(&config, (const uint8_t *)message + 12, sizeof(config));
    if (config == NULL) return ESP_ERR_INVALID_ARG;
    uint32_t identity = 0;
    esp_err_t error = esp32_mquickjs_wifi_twt_setup_submit_enter_native(config, &identity);
    if (error != ESP_OK) return error;
    esp_err_t driver_error = ESP_OK;
    error = twt_individual_setup_process(message, config, identity, &driver_error);
    if (identity != 0U) esp32_mquickjs_wifi_twt_setup_submit_complete_native(config, identity, driver_error);
    return error;
}
/* The public bTWT wrapper omits an ID check before the lower handler indexes
 * the AP's 32-entry table. Reject before any native lookup, even for non-JS
 * callers of the public API. Preserve the SDK's connected/AP capability checks. */
esp_err_t __wrap_wifi_sta_btwt_setup_process(void *message)
{
    if (message == NULL) return ESP_ERR_INVALID_ARG;
    wifi_btwt_setup_config_t *config;
    memcpy(&config, (const uint8_t *)message + 12, sizeof(config));
    if (config == NULL) return ESP_ERR_INVALID_ARG;
    bool managed = false;
    esp_err_t error = esp32_mquickjs_wifi_btwt_submit_enter_native(config, &managed);
    if (error != ESP_OK) return error;
    esp32_mquickjs_wifi_btwt_options_t options = {.config = *config, .timeout_ms = 1};
    esp_err_t driver_error = ESP_OK;
    if (!esp32_mquickjs_wifi_btwt_options_valid(&options)) error = ESP_ERR_INVALID_ARG;
    else if (managed && pm_get_sleep_type() == 0) error = ESP_ERR_INVALID_STATE;
    else error = esp32_mquickjs_wifi_twt_tx_broadcast_admit_native(config->btwt_id);
    if (error == ESP_OK && managed && !esp32_mquickjs_wifi_btwt_submit_driver_native(config))
        error = ESP_ERR_INVALID_STATE;
    if (error == ESP_OK) {
        driver_error = __real_wifi_sta_btwt_setup_process(message);
        error = driver_error != ESP_OK ? driver_error : esp32_mquickjs_wifi_btwt_timer_error();
    }
    if (managed) esp32_mquickjs_wifi_btwt_submit_complete_native(config, driver_error);
    return error;
}
#else
esp_err_t esp32_mquickjs_wifi_twt_sdk_snapshot_native(esp32_mquickjs_wifi_twt_sdk_snapshot_t *output)
{
    return output == NULL ? ESP_ERR_INVALID_ARG : ESP_ERR_NOT_SUPPORTED;
}
#endif
#endif
